package homeworks.homeworkTwo.star;

public class Task1 {
    public static void main(String[] args) {
        /*
        У Марата был взломан пароль. Он решил написать программу, которая проверяет его пароль на сложность.
        В интернете он узнал, что пароль должен отвечать следующим требованиям:
        пароль должен состоять из хотя бы 8 символов;
        в пароле должны быть:
        заглавные буквы
        строчные символы
        числа
        специальные знаки(_*-)
        Если пароль прошел проверку, то программа должна вывести в консоль строку идеально! :D,
        иначе строку: пароль не прошел проверку(
         */
    }
}
